app/controllers/api/v1/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    books = Book.all.sort_by { |b| b.title }