app/controllers/api/v1/notes_controller.rb

  def create
    note = Note.create(content: params[:content], user_id: params[:user_id], book_id: params[:book_id])
    if note.save
      note.format_date = note.created_at.strftime("%A, %d %b %Y")
      note.save
---
INSERT INTO "notes" ("content", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Thanks"], ["user_id", 1], ["book_id", 45], ["created_at", "2021-04-16 11:15:25.489047"], ["updated_at", "2021-04-16 11:15:25.489047"]]
UPDATE "notes" SET "updated_at" = ?, "format_date" = ? WHERE "notes"."id" = ?  [["updated_at", "2021-04-16 11:15:25.535929"], ["format_date", "Friday, 16 Apr 2021"], ["id", 1]]