app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "Godson"], ["created_at", "2021-04-13 13:37:19.544055"], ["updated_at", "2021-04-13 13:37:19.544055"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Godson"], ["LIMIT", 1]]
---
  def create
    user = User.find_or_create_by(username: params[:username])