app/controllers/api/v1/user_books_controller.rb

INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 78], ["created_at", "2021-04-15 16:12:55.748203"], ["updated_at", "2021-04-15 16:12:55.748203"]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 78], ["LIMIT", 1]]
---
  def create
    ub = UserBook.new(user_id: params[:user_id], book_id: params[:book_id])
    if ub.save
      book = Book.find(params[:book_id])