app/models/user.rb

  def self.current_user
    if @@current_user_id != nil
      self.all.find(@@current_user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]